<a href="https://colab.research.google.com/github/rajat4057/PythonBase/blob/master/Apply_Exercise1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Student Alcohol Consumption

### Introduction:

This time you will download a dataset from the UCI.

### Step 1. Import the necessary libraries

In [0]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv).

### Step 3. Assign it to a variable called df.

In [0]:
df=pd.read_csv('https://raw.githubusercontent.com/guipsamora/pandas_exercises/master/04_Apply/Students_Alcohol_Consumption/student-mat.csv')

### Step 4. For the purpose of this exercise slice the dataframe from 'school' until the 'guardian' column

In [0]:
stud_alcoh=df.iloc[:,:12]

In [6]:
stud_alcoh.head()

  school sex  age address famsize  ... Fedu     Mjob      Fjob  reason guardian
0     GP   F   18       U     GT3  ...    4  at_home   teacher  course   mother
1     GP   F   17       U     GT3  ...    1  at_home     other  course   father
2     GP   F   15       U     LE3  ...    1  at_home     other   other   mother
3     GP   F   15       U     GT3  ...    2   health  services    home   mother
4     GP   F   16       U     GT3  ...    3    other     other    home   father

[5 rows x 12 columns]

### Step 5. Create a lambda function that capitalize strings.

In [7]:
lambda x:x.str.upper()

### Step 6. Capitalize both Mjob and Fjob

In [0]:
stud_alcoh['Mjob']=stud_alcoh['Mjob'].apply(lambda x:x.upper())
stud_alcoh['Fjob']=stud_alcoh['Fjob'].apply(lambda x:x.upper())

In [0]:
stud_alcoh.drop('Mjob_N',axis=1,inplace=True)

In [18]:
stud_alcoh.head()

  school sex  age address famsize  ... Fedu     Mjob      Fjob  reason guardian
0     GP   F   18       U     GT3  ...    4  AT_HOME   TEACHER  course   mother
1     GP   F   17       U     GT3  ...    1  AT_HOME     OTHER  course   father
2     GP   F   15       U     LE3  ...    1  AT_HOME     OTHER   other   mother
3     GP   F   15       U     GT3  ...    2   HEALTH  SERVICES    home   mother
4     GP   F   16       U     GT3  ...    3    OTHER     OTHER    home   father

[5 rows x 12 columns]

### Step 7. Print the last elements of the data set.

In [21]:
stud_alcoh.tail()

    school sex  age address famsize  ... Fedu      Mjob      Fjob  reason guardian
390     MS   M   20       U     LE3  ...    2  SERVICES  SERVICES  course    other
391     MS   M   17       U     LE3  ...    1  SERVICES  SERVICES  course   mother
392     MS   M   21       R     GT3  ...    1     OTHER     OTHER  course    other
393     MS   M   18       R     LE3  ...    2  SERVICES     OTHER  course   mother
394     MS   M   19       U     LE3  ...    1     OTHER   AT_HOME  course   father

[5 rows x 12 columns]

### Step 8. Did you notice the original dataframe is still lowercase? Why is that? Fix it and capitalize Mjob and Fjob.

### Step 9. Create a function called majority that return a boolean value to a new column called legal_drinker (Consider majority as older than 17 years old)

In [0]:
def majority(a):
  if a>17:
    return 1
  else:
    return 0

stud_alcoh['legal_drinker']=stud_alcoh['age'].apply(majority)

In [25]:
stud_alcoh.head()

  school sex  age address  ...      Fjob  reason  guardian  legal_drinker
0     GP   F   18       U  ...   TEACHER  course    mother              1
1     GP   F   17       U  ...     OTHER  course    father              0
2     GP   F   15       U  ...     OTHER   other    mother              0
3     GP   F   15       U  ...  SERVICES    home    mother              0
4     GP   F   16       U  ...     OTHER    home    father              0

[5 rows x 13 columns]

### Step 10. Multiply every number of the dataset by 10. 
##### I know this makes no sense, don't forget it is just an exercise

In [0]:
def times10(x):
    if type(x) is int:
        return 10 * x
    return x

In [43]:
stud_alcoh.applymap(times10).head(10)

  school sex  age address  ...      Fjob      reason  guardian  legal_drinker
0     GP   F  180       U  ...   TEACHER      course    mother             10
1     GP   F  170       U  ...     OTHER      course    father              0
2     GP   F  150       U  ...     OTHER       other    mother              0
3     GP   F  150       U  ...  SERVICES        home    mother              0
4     GP   F  160       U  ...     OTHER        home    father              0
5     GP   M  160       U  ...     OTHER  reputation    mother              0
6     GP   M  160       U  ...     OTHER        home    mother              0
7     GP   F  170       U  ...   TEACHER        home    mother              0
8     GP   M  150       U  ...     OTHER        home    mother              0
9     GP   M  150       U  ...     OTHER        home    mother              0

[10 rows x 13 columns]